{"src/commands":["Réparer","Échec de la mise à jour ou de l'installation de VS Live Share en raison d'un téléchargement endommagé.","Échec de la mise à jour ou de l'installation de VS Live Share en raison d'un téléchargement endommagé.","Vous avez des problèmes avec votre installation de Live Share ?","$(messagePrefix) Vérifiez que vous disposez d'une connectivité réseau, puis cliquez sur Réparer pour redémarrer VS Code et tenter une récupération.","Réessayer","Impossible de terminer la réparation car des fichiers sont en cours d’utilisation. Mettez fin à tous les processus de l’agent Visual Studio Live Share (${processName}), puis cliquez sur Réessayer","L'hôte a mis fin à la session de collaboration actuelle. Les dossiers et les éditeurs ouverts vont se fermer.","La session de collaboration a expiré. Connectez-vous, puis réessayer.","Vous avez été supprimé de la session de collaboration.","Vous avez été bloqué de la session de collaboration.","Vous avez été déconnecté de la session de collaboration en raison d'un problème de connectivité ou parce que l'hôte est hors connexion.","La session de collaboration s'est terminée en raison d'une erreur interne.","La session de collaboration a expiré. Connectez-vous, puis réessayer.","La session de collaboration a pris fin en raison d'une mise hors connexion du réseau. Vérifiez l'état du réseau.","Dans la mesure où Azure Cloud Relay est passé hors connexion pour cette session, les nouveaux invités ne pourront peut-être pas rejoindre correctement la session via le relais. Réeffectuez le partage.","Dans la mesure où Azure Cloud Relay est passé hors connexion pour cette session, les nouveaux invités ne pourront peut-être pas rejoindre correctement la session via le relais. Réeffectuez le partage.","La session de collaboration s'est terminée en raison d'une erreur interne."],"src/extension":[],"src/localizeCallback":["What would you like to do with other collaborators?","Invite Others (Copy Link)","Copy the invitation link so you can send it to other participants.","Focus Participants","Request other participants to follow you.","Share Read-only Terminal","Share Terminal","Start a new terminal / command prompt for use by all participants.","Share Server","Expose a local TCP port to all participants.","Show Shared Servers","Show local TCP servers shared with collaboration participants.","Stop Sharing Server","Stop sharing a local TCP port for all participants.","Stop Collaboration Session","Stop collaboration session, stop sharing all content, and remove all participant access.","Sign in with your GitHub or Microsoft account to gain read/write access.","Attach to a Shared Debugging Session","Attach your debugger to a debug session that the host has shared with participants.","Access Shared Terminal","Open terminal that the host has shared with participants.","Access Shared Server","Copy a named, shared TCP port for use","Leave Collaboration Session","Stop participating in this collaboration session.","What would you like to do?","Start Collaboration Session","Start a collaboration session to share content and invite participants.","Start Read-only Collaboration Session","Start a read-only collaboration session to share content and invite participants.","Join Collaboration Session","Join a collaboration session to access shared content.","Copy again","Copy link","Make read/write","Make read-only","Start Sharing","Help","OK","Sign in","Continue as anonymous","Plus d'informations","Ne plus afficher","This invite link has expired. Share again to generate a new link.","Connexion impossible au serveur. Vérifiez que vous êtes connecté à Internet.","Le service $(shortName) nécessite une version d'extension plus récente que celle que vous avez installée.","L'extension que vous avez installée nécessite une version plus récente du service $(shortName).","L'extension $(shortName) que vous avez installée est trop ancienne pour se connecter à cette session de collaboration.","The collaboration session host is on an older version of the $(shortName) extension than you are.","The $(shortName) agent is newer than the extension","The $(shortName) agent is older than the extension","Unable to share in \"Direct\" mode as there are no suitable IP addresses. Switch to \"Auto\" or \"Relay\" mode and retry.","Could not find a compatible connection address. Switch to \"Auto\" mode and retry.","Unable to connect to the host. Verify both you and the host are online.","Unable to connect to the host in \"Relay\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Direct\" mode and retry.","Unable to connect to the host in \"Direct\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Relay\" mode and retry.","Unable to join the host due to a protocol error. Verify you and the host are online and are using the latest version of $(shortName).","Live Share didn't succeed reusing a GitHub token for authentication. This could be caused by either a token expiration or revocation. Refresh your GitHub account in VSCode and run Live Share again to fix the problem.","Live Share didn't succeed reusing a GitHub token for authentication. This could be caused by either a token expiration or revocation. Refresh your GitHub account in VSCode and run Live Share again to fix the problem.","Unexpected authentication error. Try signing in again.","Token exchange failed with code: ${code}","The host does not allow direct connections. Switch to \"Auto\" or \"Relay\" mode and retry.","Unable to connect since the host does not allow relayed connections. Switch to \"Auto\" or \"Direct\" mode and retry.","Could not join the collaboration session as it has already reached the maximum of 5 participants. To increase the participant limit, please ask the host to change the Increased Guest Limit setting, reload and then start a new collaboration session.","The host has rejected you from joining the collaboration session.","Timed out while waiting for the host to respond to your request.","Request to join the collaboration session was canceled.","Collaboration session not found.","The host has blocked you from joining the collaboration. If this was accidental, please ask the host to restart the session.","Could not connect to the server. Received non success status code.","Live Share was unable to access the login keychain. This can happen if you recently changed your password or your login keychain has become corrupted. See more info for details on how to fix it.","The host's network conditions are poor or they are no longer connected to the Live Share cloud relay. Ask them to check their network conditions, restart the collaboration session, and try again.","Unable to connect to Live Share cloud relay. Check your proxy, firewall and network settings and try again.","The host doesn’t allow starting the debugger. If needed, ask them to enable it.","Could not connect to the server. HTTPS connection failed, verify there are no self-signed certificates or custom cert validation policies blocking Live Share.","Failed to create a Planned Session","Failed to delete a Planned Session","Failed to rename Planned Session","Failed to copy Planned Session link","Failed to join Planned Sessions","Il semble que vous ayez un répertoire contenant des fichiers dont le nom est identique, à l'exception de la casse. Cette opération n'est pas prise en charge et peut entraîner des erreurs.","Vous exécutez VS Code en dehors du dossier Applications, nous ne pouvons donc pas installer la prise en charge de la participation aux sessions à l'aide d'un lien de navigateur. Vous pouvez toujours rejoindre des sessions manuellement.","Échec de l'installation de la prise en charge de la participation aux sessions à l'aide d'un lien de navigateur. Vous pouvez toujours rejoindre les sessions manuellement.","Ouverture d'une session à distance...","Accès à la session à distance...","En attente d'approbation de l'hôte...","Perte de la connexion. Reconnexion à l'hôte...","Création de la session planifiée...","Suppression de la session planifiée...","Le chemin est introuvable : lazyLoad(() => nlsloc($(path)","Le chemin existe déjà : lazyLoad(() => nlsloc($(path)","Accès refusé : lazyLoad(() => nlsloc($(path)","Le fichier est trop volumineux.","Le fichier n'est pas disponible."," a demandé à rejoindre la session de collaboration.","Accepter","Accepter en lecture seule","Accepter en lecture/écriture","Rejeter","Toujours accepter l'anonymat"," a rejoint la session de collaboration."," a été déconnecté.","a quitté la session de collaboration.","$(userId) a attiré votre attention.","$(userId) vous ont demandé de les suivre.","Lien de session copié.","Informations de travail en mode collaboratif copiées dans le Presse-papiers.","Pour pouvoir rejoindre une session à l'aide d'un lien de navigateur, nous avons besoin de l'autorisation d'exécuter un programme d'installation sur votre système. Votre système d'exploitation peut vous demander votre mot de passe administrateur (sudo) dans un terminal. Installer maintenant ?","Commande d'installation du lanceur de liens du navigateur copiée dans le presse-papiers.","Vous pouvez exécuter la commande « Live Share: Launcher Setup » pour terminer l’intégration ultérieurement.","Le lanceur de liens du navigateur a été installé avec succès.","Copier à la place","Installer","Invitation link copied to clipboard! Send it to anyone you trust","Session shared! Click \"Copy link\" to get an invitation link ","or click \"More info\" to learn about secure sharing.","A Reusable Session link is copied to the clipboard. Save the link to a secure location. Learn more about how to use your Session by clicking \"More info\".","A Reusable Session link is created! Click \"Copy link\" to get the link. Save the link to a secure location. Learn more about how to use your Session by clicking \"More info\".","Sign in with VS Live Share to join a collaboration session.","You need to sign in before joining the collaboration session.","$(options.title)","Cannot edit the terminal in read-only mode (anonymous). Sign in to proceed.","Sélectionner une session planifiée","Expiration : ","Créer une session planifiée...","Créer une session planifiée","Spécifier le nom de la session planifiée","Le nom ne doit pas être vide. Entrez un nom alphanumérique pour la session","Le nom est non valide. Entrez un nom alphanumérique pour la session"," (En lecture seule)"," (Anonyme et en lecture seule)"," (Anonyme et en lecture/écriture)"," (Anonyme)","Dans une session Live Share","Taper pour rechercher des contacts","Sélectionner le fournisseur de présence à utiliser","Invité","Invité","Invité","Démarrer la session de collaboration..."," (En lecture seule)"," (Anonyme et en lecture seule)"," (Anonyme et en lecture/écriture)","Utilisateur en lecture seule","Continuer en tant que","Continuer sans se connecter en tant qu'invité en lecture seule","Sélectionnez un compte pour vous connecter","Se connecter avec le compte ${key}","Impossible de créer le thread de commentaires","Impossible de supprimer le thread de commentaires","Impossible de répondre","Impossible de modifier le commentaire","Impossible d'enregistrer le commentaire","Impossible d'annuler la modification du commentaire","Impossible de supprimer le commentaire","supprimer d'abord les autres commentaires du thread","Commentaires de session Live Share","Participants :","Conversation Live Share : $(unreads) nouveaux éléments","Conversation","Conversation de session","Conversation Live Share","Sélectionner un canal de conversation","($(unread) nouveaux éléments)","$(username) est en train de taper...","_a démarré la session Live Share_","_a mis fin à la session Live Share_","_a rejoint la session Live Share_","_a quitté la session Live Share_","L'hôte de cette session de collaboration est actuellement déconnecté de la conversation ou utilise une version de _Live Share_ qui ne prend pas en charge cette fonctionnalité. [En savoir plus](https://aka.ms/vsls-chat)","La personne que vous essayez de contacter est actuellement indisponible ou utilise une version de _Live Share_ qui ne prend pas en charge cette fonctionnalité. [En savoir plus](https://aka.ms/vsls-chat)","Utilisateur inconnu","Converser avec ce contact","Ouvrir le canal de conversation de session","Le service de conversation est actuellement déconnecté. Réessayez dans quelques instants.","Mettez à jour l'extension complémentaire 'Live Share Chat'. La version installée n'est plus compatible. [En savoir plus](https://aka.ms/vsls-chat)","What would you like to do?","$(x) Disconnect","Disconnect from the audio call.","$(mute) Mute Yourself","$(unmute) Unmute Yourself","Mute yourself so others cannot hear you.","Unmute your microphone so others can hear you.","$(organization) View Participants","View the list of Live Share participants that are currently in the call.","$(unmute) Configure Speakers","Select which speakers to use for the audio call.","$(megaphone) Configure Microphone","Select which microphone to use for the audio call.","Participants (0)","Join audio call...","Start audio call...","Joining audio call...","Starting audio call...","Ending audio call...","Audio Call","Audio Call Participants ($(participantCount))","Unknown user","$(displayName) (you)","Join","Connecting audio...","Disconnecting audio...","Audio Call Participants","Select the microphone to use","Select the speaker to use","An audio call has been started for this collaboration session.","Le jeu de résultats contient uniquement un sous-ensemble de toutes les correspondances. Soyez plus précis dans votre recherche pour affiner les résultats.","[Nouveau]","L'hôte a partagé un serveur $(sessionName) avec vous. Voulez-vous le voir dans le navigateur ?","Oui","Non","Impossible d'ouvrir le serveur $(sessionName) dans le navigateur. L'hôte a arrêté le partage du serveur","Espace de travail Live Share","Le notebook est ouvert sur l'hôte avec","Utilisez la même vue pour ouvrir","Le travail en mode collaboratif n'est pas pris en charge pour les notebooks ouverts avec des vues non partagées.","Noyau permettant d'exécuter des cellules sur la machine de l'hôte","L'hôte vous a octroyé l'accès à l'exécution de cellules de notebook","L'hôte a rejeté votre demande d'exécution de cellules de notebook","Vous ne pouvez pas exécuter de cellules de notebook dans une session en lecture seule","L'hôte ne vous a pas octroyé l'autorisation d'exécuter des cellules de notebook","Demander l'accès","Autoriser pour cette session","Autoriser toujours","Rejeter","Un invité demande l'autorisation d'exécuter des cellules de notebook","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link"],"src/_new_/commands/ShareCommand":["Votre espace de travail est partagé, mais un ou plusieurs dossiers ne sont pas locaux et ne peuvent pas être inclus dans l'espace de travail partagé.","Connexion impossible à Azure Relay, vous pouvez uniquement collaborer avec des invités sur le même réseau. Vérifiez que votre pare-feu réseau, votre DNS ou votre proxy ne bloque pas l'accès à Microsoft Azure Relay, puis réessayez."],"src/_new_/commands/ShareCommandUtilities":["Espace de travail Live Share"],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share est maintenant en GA. Nous vous remercions de nous avoir aidé à y parvenir ! En tant que membre du programme Insider, vous allez continuer à recevoir de nouvelles fonctionnalités en avant-première.","En savoir plus","Passer à des fonctionnalités stables"],"src/_new_/util/WorkspaceFirewallUtil":["Partage impossible. Visual Studio Live Share est actuellement en mode de connexion \"Direct\" et votre pare-feu a bloqué les connexions sécurisées entrantes nécessaires pour démarrer une session de collaboration.\r\n\r\nPour effectuer le partage, vous devez modifier vos règles de pare-feu de sorte à autoriser vsls-agent.exe à accepter les connexions entrantes, ou basculez sur le mode de connexion \"Auto\" ou \"Relais\".","Votre pare-feu empêche vsls-agent.exe d'accepter les connexions directes sur les ports dont Visual Studio Live Share a besoin pour améliorer les performances des collaborateurs figurant sur le même réseau.\r\n\r\nLive Share doit maintenant basculer en mode de connexion \"Relais\" pour toutes les futures sessions et router le trafic avec un relais cloud. Appuyez sur \"Annuler\" si vous préférez arrêter le partage","Visual Studio Live Share est actuellement en mode de connexion \"Direct\" et doit accepter les connexions entrantes sécurisées pendant le partage.\r\n\r\nVotre pare-feu doit maintenant vous inviter à donner l'accès à vsls-agent.exe sur les ports nécessaires. Si vous refusez l'accès, vous ne pouvez pas effectuer de partage.","Visual Studio Live Share est actuellement en mode de connexion \"Auto\" qui améliore les performances des collaborateurs figurant sur le même réseau en acceptant des connexions entrantes sécurisées pendant le partage.\r\n\r\nVotre pare-feu doit maintenant vous inviter à donner l'accès à vsls-agent.exe sur les ports nécessaires. Si vous refusez l'accès, toutes les connexions sont routées par un relais cloud."],"src/abstractions/node/agent":[]}