{"src/commands":["Ripristina","Non è stato possibile aggiornare o installare VS Live Share a causa di un download danneggiato.","Non è stato possibile aggiornare o installare VS Live Share a causa di un download danneggiato.","Si è verificato un problema con l'installazione di Live Share?","$(messagePrefix) Assicurarsi che la connessione di rete sia disponibile, quindi fare clic su `Ripristina` per riavviare VS Code e provare a eseguire il ripristino.","Riprova","Non è possibile completare il ripristino poiché i file sono in uso. Terminare tutti i processi dell’agente Visual Studio Live Share (${processName}) e fare clic su “Riprova”.","L'organizzatore ha terminato la sessione di collaborazione corrente. Cartelle ed editor aperti ora verranno chiusi.","La sessione di collaborazione è scaduta. Accedere e riprovare.","Si è stati rimossi dalla sessione di collaborazione.","L'utente è stato bloccato dalla sessione di collaborazione.","Si è stati disconnessi dalla sessione di collaborazione a causa di un problema di connettività o perché l'organizzatore è passato alla modalità offline.","La sessione di collaborazione è stata terminata a causa di un errore interno.","La sessione di collaborazione è scaduta. Accedere e riprovare.","La sessione di collaborazione è stata terminata perché la connessione di rete non è più disponibile. Verificare lo stato della rete.","La funzionalità di inoltro cloud di Azure è passata alla modalità offline per questa sessione. È possibile che i nuovi partecipanti non riescano ad accedere tramite inoltro. Provare a ripetere la condivisione.","La funzionalità di inoltro cloud di Azure è passata alla modalità offline per questa sessione. È possibile che i nuovi partecipanti non riescano ad accedere tramite inoltro. Provare a ripetere la condivisione.","La sessione di collaborazione è stata terminata a causa di un errore interno."],"src/extension":[],"src/localizeCallback":["What would you like to do with other collaborators?","Invite Others (Copy Link)","Copy the invitation link so you can send it to other participants.","Focus Participants","Request other participants to follow you.","Share Read-only Terminal","Share Terminal","Start a new terminal / command prompt for use by all participants.","Share Server","Expose a local TCP port to all participants.","Show Shared Servers","Show local TCP servers shared with collaboration participants.","Stop Sharing Server","Stop sharing a local TCP port for all participants.","Stop Collaboration Session","Stop collaboration session, stop sharing all content, and remove all participant access.","Sign in with your GitHub or Microsoft account to gain read/write access.","Attach to a Shared Debugging Session","Attach your debugger to a debug session that the host has shared with participants.","Access Shared Terminal","Open terminal that the host has shared with participants.","Access Shared Server","Copy a named, shared TCP port for use","Leave Collaboration Session","Stop participating in this collaboration session.","What would you like to do?","Start Collaboration Session","Start a collaboration session to share content and invite participants.","Start Read-only Collaboration Session","Start a read-only collaboration session to share content and invite participants.","Join Collaboration Session","Join a collaboration session to access shared content.","Copy again","Copy link","Make read/write","Make read-only","Start Sharing","Help","OK","Sign in","Continue as anonymous","Altre informazioni","Non visualizzare più questo messaggio","This invite link has expired. Share again to generate a new link.","Non è stato possibile connettersi al server. Verificare di essere connessi a Internet.","Con il servizio $(shortName) è richiesta una versione dell'installazione più recente rispetto a quella installata.","Con l'estensione installata è richiesta una versione più recente del servizio $(shortName).","L'estensione $(shortName) installata è troppo vecchia per la connessione a questa sessione di collaborazione.","The collaboration session host is on an older version of the $(shortName) extension than you are.","The $(shortName) agent is newer than the extension","The $(shortName) agent is older than the extension","Unable to share in \"Direct\" mode as there are no suitable IP addresses. Switch to \"Auto\" or \"Relay\" mode and retry.","Could not find a compatible connection address. Switch to \"Auto\" mode and retry.","Unable to connect to the host. Verify both you and the host are online.","Unable to connect to the host in \"Relay\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Direct\" mode and retry.","Unable to connect to the host in \"Direct\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Relay\" mode and retry.","Unable to join the host due to a protocol error. Verify you and the host are online and are using the latest version of $(shortName).","Live Share didn't succeed reusing a GitHub token for authentication. This could be caused by either a token expiration or revocation. Refresh your GitHub account in VSCode and run Live Share again to fix the problem.","Live Share didn't succeed reusing a GitHub token for authentication. This could be caused by either a token expiration or revocation. Refresh your GitHub account in VSCode and run Live Share again to fix the problem.","Unexpected authentication error. Try signing in again.","Token exchange failed with code: ${code}","The host does not allow direct connections. Switch to \"Auto\" or \"Relay\" mode and retry.","Unable to connect since the host does not allow relayed connections. Switch to \"Auto\" or \"Direct\" mode and retry.","Could not join the collaboration session as it has already reached the maximum of 5 participants. To increase the participant limit, please ask the host to change the Increased Guest Limit setting, reload and then start a new collaboration session.","The host has rejected you from joining the collaboration session.","Timed out while waiting for the host to respond to your request.","Request to join the collaboration session was canceled.","Collaboration session not found.","The host has blocked you from joining the collaboration. If this was accidental, please ask the host to restart the session.","Could not connect to the server. Received non success status code.","Live Share was unable to access the login keychain. This can happen if you recently changed your password or your login keychain has become corrupted. See more info for details on how to fix it.","The host's network conditions are poor or they are no longer connected to the Live Share cloud relay. Ask them to check their network conditions, restart the collaboration session, and try again.","Unable to connect to Live Share cloud relay. Check your proxy, firewall and network settings and try again.","The host doesn’t allow starting the debugger. If needed, ask them to enable it.","Could not connect to the server. HTTPS connection failed, verify there are no self-signed certificates or custom cert validation policies blocking Live Share.","Failed to create a Planned Session","Failed to delete a Planned Session","Failed to rename Planned Session","Failed to copy Planned Session link","Failed to join Planned Sessions","Sembra che sia presente una directory contenente file con lo stesso nome, ad eccezione dell'uso di maiuscole/minuscole. Questo comportamento non è supportato e potrebbe causare errori.","VS Code viene eseguito all'esterno della cartella Applications, di conseguenza non è possibile installare il supporto per la partecipazione alle sessioni tramite Browser Link. È comunque possibile partecipare alle sessioni in modo manuale.","Non è stato possibile installare il supporto per la partecipazione alle sessioni tramite Browser Link. È comunque possibile partecipare alle sessioni in modo manuale.","Apertura della sessione remota...","Accesso alla sessione remota...","In attesa dell'approvazione dell'organizzatore...","Connessione persa. Riconnessione all'host...","Creazione della una sessione pianificata...","Eliminazione della sessione pianificata...","Percorso non trovato: lazyLoad(() => nlsloc($(path)","Percorso già esistente: lazyLoad(() => nlsloc($(path)","Accesso negato: lazyLoad(() => nlsloc($(path)","Il file è troppo grande.","Il file non è disponibile.","ha richiesto l'accesso alla sessione di collaborazione.","Accetta","Accetta di sola lettura","Accetta di lettura/scrittura","Rifiuta","Accetta sempre anonimi","ha eseguito l'accesso alla sessione di collaborazione."," è stato disconnesso.","ha abbandonato la sessione di collaborazione.","$(userId) ha richiamato l'attenzione.","$(userId) ha richiesto di essere seguito.","Il collegamento alla sessione è stato copiato.","Le informazioni sulla modifica congiunta sono state copiate negli Appunti.","Per supportare la partecipazione a una sessione tramite Browser Link, è necessario disporre dell'autorizzazione per eseguire un programma di installazione nel sistema. Il sistema operativo potrebbe richiedere la password dell'amministratore (sudo) in un terminale. Installare ora?","Il comando di installazione del launcher di Browser Link è stato copiato negli Appunti.","È possibile eseguire il comando \"Live Share: Configura launcher\" per completare l'integrazione in un secondo momento.","Il launcher di Browser Link è stato installato.","Copia invece","Installa","Invitation link copied to clipboard! Send it to anyone you trust","Session shared! Click \"Copy link\" to get an invitation link ","or click \"More info\" to learn about secure sharing.","A Reusable Session link is copied to the clipboard. Save the link to a secure location. Learn more about how to use your Session by clicking \"More info\".","A Reusable Session link is created! Click \"Copy link\" to get the link. Save the link to a secure location. Learn more about how to use your Session by clicking \"More info\".","Sign in with VS Live Share to join a collaboration session.","You need to sign in before joining the collaboration session.","$(options.title)","Cannot edit the terminal in read-only mode (anonymous). Sign in to proceed.","Seleziona una sessione pianificata","Scadenza: ","Crea sessione pianificata...","Crea una sessione pianificata","Specificare il nome della sessione pianificata","Il nome non può essere vuoto. Immettere un nome alfanumerico per la sessione","Il nome non è valido. Immettere un nome alfanumerico per la sessione"," (Di sola lettura)"," (Anonimo e di sola lettura)"," (Anonimo e di lettura/scrittura)"," (Anonimo)","In una sessione di Live Share","Digitare per cercare contatti","Selezionare il provider di presenza da usare","Invitato","Invitato","Invitato","Avvia la sessione di collaborazione..."," (Di sola lettura)"," (Anonimo e di sola lettura)"," (Anonimo e di lettura/scrittura)","Utente in sola lettura","Continua come","Continua senza eseguire l'accesso come partecipante in sola lettura","Selezionare l'account per l'accesso","Accedere con l'account ${key}","Non è possibile creare il thread di commento","Non è possibile eliminare il thread di commento","Non è possibile rispondere","Non è possibile modificare il commento","Non è possibile salvare il commento","Non è possibile annullare la modifica del commento","Non è possibile eliminare il commento","eliminare prima gli altri commenti sul thread","Commenti sessione di Live Share","Partecipanti:","Chat di Live Share: $(unreads) nuovi","Chat","Chat della sessione","Chat di Live Share","Seleziona un canale di chat","($(unread) nuovo)","$(username) sta digitando...","_ha avviato la sessione di Live Share_","_ha terminato la sessione di Live Share_","_ha partecipato alla sessione di Live Share_","_ha abbandonato la sessione di Live Share_","L'organizzatore di questa sessione di collaborazione è attualmente disconnesso dalla chat oppure usa una versione di _Live Share_ che non supporta questa funzionalità. [Altre informazioni](https://aka.ms/vsls-chat)","La persona che si sta provando a contattare non è attualmente disponibile o usa una versione di _Live Share_ che non supporta questa funzionalità. [Altre informazioni](https://aka.ms/vsls-chat)","Utente sconosciuto","Chatta con questo contatto","Apri il canale di chat della sessione","Il servizio chat è attualmente disconnesso. Riprovare tra poco.","Aggiornare l'estensione complementare `Chat di Live Share`. La versione installata non è più compatibile. [Altre informazioni](https://aka.ms/vsls-chat)","What would you like to do?","$(x) Disconnect","Disconnect from the audio call.","$(mute) Mute Yourself","$(unmute) Unmute Yourself","Mute yourself so others cannot hear you.","Unmute your microphone so others can hear you.","$(organization) View Participants","View the list of Live Share participants that are currently in the call.","$(unmute) Configure Speakers","Select which speakers to use for the audio call.","$(megaphone) Configure Microphone","Select which microphone to use for the audio call.","Participants (0)","Join audio call...","Start audio call...","Joining audio call...","Starting audio call...","Ending audio call...","Audio Call","Audio Call Participants ($(participantCount))","Unknown user","$(displayName) (you)","Join","Connecting audio...","Disconnecting audio...","Audio Call Participants","Select the microphone to use","Select the speaker to use","An audio call has been started for this collaboration session.","Il set di risultati contiene solo un subset di tutte le corrispondenze. Eseguire una ricerca più specifica per ridurre il numero di risultati.","[Novità]","L'organizzatore ha condiviso un server $(sessionName). Visualizzarlo nel browser?","Sì","No","Non è possibile aprire il server $(sessionName) nel browser. L'organizzatore ha annullato la condivisione","Area di lavoro di Live Share","L'organizzatore ha il notebook aperto con","Usa la stessa visualizzazione per aprire","La modifica congiunta non è supportata per i notebook aperti con visualizzazioni non condivise.","Kernel per l'esecuzione delle celle nel computer dell'organizzatore","L'organizzatore ha concesso l'accesso per eseguire le celle del notebook","L'organizzatore ha rifiutato la richiesta di eseguire le celle del notebook","Non è possibile eseguire le celle del notebook in una sessione di sola lettura","L'organizzatore non ha concesso l'autorizzazione per eseguire le celle del notebook","Richiedi l'accesso","Consenti per questa sessione","Consenti sempre","Rifiuta","Un partecipante richiede l'autorizzazione per eseguire le celle del notebook","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link"],"src/_new_/commands/ShareCommand":["L'area di lavoro è stata condivisa, ma una o più cartelle non sono cartelle locali e non è stato possibile includerle nell'area di lavoro condivisa.","Non è possibile connettersi a Inoltro di Azure. È possibile collaborare solo con i partecipanti nella stessa rete. Verificare che il firewall di rete, il DNS o il proxy non blocchi l'accesso a Inoltro di Microsoft Azure e riprovare."],"src/_new_/commands/ShareCommandUtilities":["Area di lavoro di Live Share"],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share è ora disponibile a livello generale. Grazie per averci consentito di raggiungere questo risultato. In qualità di partecipante al programma Insider, si continuerà a ricevere per primi le nuove funzionalità.","Altre info","Passa alle funzionalità stabili"],"src/_new_/util/WorkspaceFirewallUtil":["Non è possibile condividere. Visual Studio Live Share è attualmente in modalità di connessione \"Direct\" e il firewall ha bloccato le connessioni protette in ingresso necessarie per avviare una sessione di collaborazione. \r\n\r\nPer condividere, è necessario modificare le regole del firewall per consentire a vsls-agent.exe di accettare connessioni in ingresso o passare alla modalità di connessione \"Auto\" o \"Relay\".","Il firewall impedisce a vsls-agent.exe di accettare connessioni dirette su porte richieste da Visual Studio Live Share per migliorare le prestazioni per i collaboratori nella stessa rete.\r\n \r\nLive Share passerà ora alla modalità di connessione \"Relay\" per tutte le sessioni future e instraderà il traffico tramite un inoltro cloud. In alternativa, premere \"Annulla\" per arrestare la condivisione.","Visual Studio Live Share è attualmente in modalità di connessione \"Direct\" e, per funzionare, deve accettare connessioni protette in ingresso durante la condivisione.\r\n\r\nIl firewall chiederà ora di concedere a vsls-agent.exe l'accesso alle porte richieste. Se si rifiuta di concedere l'accesso, non sarà possibile condividere.","Visual Studio Live Share è attualmente in modalità di connessione \"Auto\", che consente di migliorare le prestazioni per i collaboratori nella stessa rete accettando connessioni protette in ingresso durante la condivisione.\r\n\r\nIl firewall chiederà ora di concedere a vsls-agent.exe l'accesso alle porte richieste. Se si rifiuta di concedere questo accesso, tutte le connessioni verranno instradate tramite un inoltro cloud."],"src/abstractions/node/agent":[]}