{"src/commands":["Reparar","Error de actualización o instalación de VS Live Share debido a una descarga incorrecta.","Error de actualización o instalación de VS Live Share debido a una descarga incorrecta.","¿Tiene problemas con la instalación de Live Share?","$(messagePrefix) Asegúrese de que tiene conectividad de red y, a continuación, haga clic en \"Reparar\" para reiniciar VS Code e intentar la recuperación.","Reintentar","No se puede finalizar la reparación porque hay archivos en uso. Finalice todos los procesos del agente de Visual Studio Live Share (${processName}) y haga clic en \"Reintentar\".","El anfitrión ha finalizado la sesión de colaboración actual. Las carpetas y los editores abiertos se cerrarán.","La sesión de colaboración ha expirado. Inicie sesión y vuelva a intentarlo.","Se le ha eliminado de la sesión de colaboración.","Has sido bloqueado de la sesión de colaboración.","Se le ha desconectado de la sesión de colaboración debido a un problema de conectividad o a que el anfitrión se ha desconectado.","La sesión de colaboración ha terminado debido a un error interno.","La sesión de colaboración ha expirado. Inicie sesión y vuelva a intentarlo.","La sesión de colaboración ha finalizado porque la red se ha quedado sin conexión. Compruebe el estado de la red.","La retransmisión a través de la nube de Azure se ha quedado sin conexión en esta sesión y es posible que no puedan unirse nuevos invitados mediante retransmisión. Considere la posibilidad de volver a compartir.","La retransmisión a través de la nube de Azure se ha quedado sin conexión en esta sesión y es posible que no puedan unirse nuevos invitados mediante retransmisión. Considere la posibilidad de volver a compartir.","La sesión de colaboración ha terminado debido a un error interno."],"src/extension":[],"src/localizeCallback":["What would you like to do with other collaborators?","Invite Others (Copy Link)","Copy the invitation link so you can send it to other participants.","Focus Participants","Request other participants to follow you.","Share Read-only Terminal","Share Terminal","Start a new terminal / command prompt for use by all participants.","Share Server","Expose a local TCP port to all participants.","Show Shared Servers","Show local TCP servers shared with collaboration participants.","Stop Sharing Server","Stop sharing a local TCP port for all participants.","Stop Collaboration Session","Stop collaboration session, stop sharing all content, and remove all participant access.","Sign in with your GitHub or Microsoft account to gain read/write access.","Attach to a Shared Debugging Session","Attach your debugger to a debug session that the host has shared with participants.","Access Shared Terminal","Open terminal that the host has shared with participants.","Access Shared Server","Copy a named, shared TCP port for use","Leave Collaboration Session","Stop participating in this collaboration session.","What would you like to do?","Start Collaboration Session","Start a collaboration session to share content and invite participants.","Start Read-only Collaboration Session","Start a read-only collaboration session to share content and invite participants.","Join Collaboration Session","Join a collaboration session to access shared content.","Copy again","Copy link","Make read/write","Make read-only","Start Sharing","Help","OK","Sign in","Continue as anonymous","Más información","No volver a mostrar","This invite link has expired. Share again to generate a new link.","No se pudo conectar con el servidor. Compruebe que está conectado a Internet.","El servicio de $(shortName) requiere una versión más reciente de la extensión que ha instalado.","La extensión que ha instalado requiere una versión más reciente del servicio $(shortName).","La extensión de $(shortName) que ha instalado es demasiado antigua para conectarse a esta sesión de colaboración.","The collaboration session host is on an older version of the $(shortName) extension than you are.","The $(shortName) agent is newer than the extension","The $(shortName) agent is older than the extension","Unable to share in \"Direct\" mode as there are no suitable IP addresses. Switch to \"Auto\" or \"Relay\" mode and retry.","Could not find a compatible connection address. Switch to \"Auto\" mode and retry.","Unable to connect to the host. Verify both you and the host are online.","Unable to connect to the host in \"Relay\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Direct\" mode and retry.","Unable to connect to the host in \"Direct\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Relay\" mode and retry.","Unable to join the host due to a protocol error. Verify you and the host are online and are using the latest version of $(shortName).","Live Share didn't succeed reusing a GitHub token for authentication. This could be caused by either a token expiration or revocation. Refresh your GitHub account in VSCode and run Live Share again to fix the problem.","Live Share didn't succeed reusing a GitHub token for authentication. This could be caused by either a token expiration or revocation. Refresh your GitHub account in VSCode and run Live Share again to fix the problem.","Unexpected authentication error. Try signing in again.","Token exchange failed with code: ${code}","The host does not allow direct connections. Switch to \"Auto\" or \"Relay\" mode and retry.","Unable to connect since the host does not allow relayed connections. Switch to \"Auto\" or \"Direct\" mode and retry.","Could not join the collaboration session as it has already reached the maximum of 5 participants. To increase the participant limit, please ask the host to change the Increased Guest Limit setting, reload and then start a new collaboration session.","The host has rejected you from joining the collaboration session.","Timed out while waiting for the host to respond to your request.","Request to join the collaboration session was canceled.","Collaboration session not found.","The host has blocked you from joining the collaboration. If this was accidental, please ask the host to restart the session.","Could not connect to the server. Received non success status code.","Live Share was unable to access the login keychain. This can happen if you recently changed your password or your login keychain has become corrupted. See more info for details on how to fix it.","The host's network conditions are poor or they are no longer connected to the Live Share cloud relay. Ask them to check their network conditions, restart the collaboration session, and try again.","Unable to connect to Live Share cloud relay. Check your proxy, firewall and network settings and try again.","The host doesn’t allow starting the debugger. If needed, ask them to enable it.","Could not connect to the server. HTTPS connection failed, verify there are no self-signed certificates or custom cert validation policies blocking Live Share.","Failed to create a Planned Session","Failed to delete a Planned Session","Failed to rename Planned Session","Failed to copy Planned Session link","Failed to join Planned Sessions","Parece que tiene un directorio de archivos con el mismo nombre, salvo por el uso de mayúsculas y minúsculas. Esta acción no se admite y puede generar errores.","Está ejecutando VS Code fuera de la carpeta Aplicaciones, por lo que no se puede instalar compatibilidad para unirse a sesiones mediante un vínculo del explorador. Todavía puede unirse a las sesiones manualmente.","No se pudo instalar la compatibilidad para unirse a sesiones mediante un vínculo del explorador. Todavía puede unirse a las sesiones manualmente.","Apertura de sesión remota...","Unirse a sesión remota...","Esperando aprobación del anfitrión...","Se perdió la conexión. Reconectando con el host...","Creando la sesión planeada...","Eliminando la sesión planeada...","No se encontró la ruta de acceso: lazyLoad(() => nlsloc($(path)","La ruta de acceso ya existe: lazyLoad(() => nlsloc($(path)","Acceso denegado: lazyLoad(() => nlsloc($(path)","El archivo es demasiado grande.","El archivo no está disponible.","pidió unirse a la sesión de colaboración.","Aceptar","Aceptar solo lectura","Aceptar lectura y escritura","Rechazar","Aceptar siempre anónimos","se unió a la sesión de colaboración."," se desconectó."," dejó la sesión de colaboración.","$(userId) ha centrado su atención.","$(userId) han solicitado que les siga.","El vínculo de la sesión se ha copiado.","La información de edición conjunta se ha copiado en el Portapapeles.","Para poder entrar en una sesión mediante un enlace del navegador, necesitamos permiso para ejecutar un instalador en su sistema. Su sistema operativo puede pedirle su contraseña de administrador (sudo) en un terminal. ¿Instalar ahora?","Comando de instalación del iniciador de vínculos del explorador copiado en el Portapapeles.","Puede ejecutar el comando \"Live Share: Instalación del iniciador\" para completar la integración más adelante.","El iniciador de vínculos del explorador se instaló correctamente.","Copiar en su lugar","Instalar","Invitation link copied to clipboard! Send it to anyone you trust","Session shared! Click \"Copy link\" to get an invitation link ","or click \"More info\" to learn about secure sharing.","A Reusable Session link is copied to the clipboard. Save the link to a secure location. Learn more about how to use your Session by clicking \"More info\".","A Reusable Session link is created! Click \"Copy link\" to get the link. Save the link to a secure location. Learn more about how to use your Session by clicking \"More info\".","Sign in with VS Live Share to join a collaboration session.","You need to sign in before joining the collaboration session.","$(options.title)","Cannot edit the terminal in read-only mode (anonymous). Sign in to proceed.","Seleccionar una sesión planeada","Expiración: ","Crear una sesión planeada...","Crear una sesión planeada","Especificar el nombre de la sesión planeada","El nombre no puede estar vacío. Escriba un nombre alfanumérico para la sesión.","El nombre no es válido. Escriba un nombre alfanumérico para la sesión."," (Solo lectura)"," (Anónimo y solo lectura)"," (Anónimo, lectura y escritura)"," (Anónimo)","En una sesión de Live Share","Escribir para buscar contactos","Seleccione el proveedor de presencia que debe utilizarse","Invitado","Invitado","Invitado","Iniciar la sesión de colaboración..."," (Solo lectura)"," (Anónimo y solo lectura)"," (Anónimo, lectura y escritura)","Usuario de solo lectura","Continuar como","Continuar sin iniciar sesión como invitado de solo lectura","Seleccione una cuenta para iniciar sesión","Iniciar sesión con la cuenta de ${key}","No se puede crear el hilo de comentarios","No se puede eliminar el hilo de comentarios","No se puede responder","No se puede editar el comentario.","No se puede guardar el comentario.","No se puede cancelar la edición del comentario.","No se puede eliminar el comentario","eliminar primero otros comentarios del hilo","Comentarios de la sesión de Live Share","Participantes:","Chat de Live Share: $(unreads) nuevos","Chat","Chat de la sesión","Chat de Live Share","Seleccionar un canal de chat","($(unread) nuevo)","$(username) está escribiendo...","_ha iniciado la sesión de Live Share_","_ha finalizado la sesión de Live Share_","_se ha unido a la sesión de Live Share_","_ha abandonado la sesión de Live Share_","El host de esta sesión de colaboración está usando una versión de _Live Share_ que no admite esta característica o está desconectado del chat. [Más información](https://aka.ms/vsls-chat)","La persona con la que intenta contactar está usando una versión de _Live Share_ que no admite esta característica o no está disponible. [Más información](https://aka.ms/vsls-chat)","Usuario desconocido","Chat con este contacto","Abrir sesión de canal de chat","El servicio de chat está desconectado. Vuelva a intentarlo en breve.","Actualice la extensión complementaria \"Live Share Chat\". La versión instalada ya no es compatible. [Más información](https://aka.ms/vsls-chat)","What would you like to do?","$(x) Disconnect","Disconnect from the audio call.","$(mute) Mute Yourself","$(unmute) Unmute Yourself","Mute yourself so others cannot hear you.","Unmute your microphone so others can hear you.","$(organization) View Participants","View the list of Live Share participants that are currently in the call.","$(unmute) Configure Speakers","Select which speakers to use for the audio call.","$(megaphone) Configure Microphone","Select which microphone to use for the audio call.","Participants (0)","Join audio call...","Start audio call...","Joining audio call...","Starting audio call...","Ending audio call...","Audio Call","Audio Call Participants ($(participantCount))","Unknown user","$(displayName) (you)","Join","Connecting audio...","Disconnecting audio...","Audio Call Participants","Select the microphone to use","Select the speaker to use","An audio call has been started for this collaboration session.","El conjunto de resultados solo contiene un subconjunto de todas las coincidencias. Sea más específico en la búsqueda para acotar los resultados.","[Nuevo]","El host ha compartido un servidor $(sessionName) con usted. ¿Quiere verlo en el explorador?","Sí","No","No se puede abrir el servidor $(sessionName) en el explorador. El host ha dejado de compartir el servidor.","Área de trabajo de Live Share","El host tiene el bloc de notas abierto con","Usar la misma vista para abrir","No se admite la edición conjunta para los blocs de notas abiertos con vistas no compartidas.","Kernel para ejecutar celdas en la máquina del host","El host le ha concedido acceso para ejecutar celdas del bloc de notas.","El host ha rechazado la solicitud para ejecutar celdas del bloc de notas.","No se pueden ejecutar celdas del bloc de notas en una sesión de solo lectura.","El host no le ha concedido permiso para ejecutar celdas del bloc de notas.","Solicitar acceso","Permitir para esta sesión","Permitir siempre","Rechazar","Un invitado está solicitando permiso para ejecutar celdas del bloc de notas.","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link"],"src/_new_/commands/ShareCommand":["Su área de trabajo se compartió, pero una o más carpetas no eran carpetas locales y no se pudieron incluir en el área de trabajo compartida.","No se puede conectar con Azure Relay, solo puede colaborar con invitados que estén en la misma red. Compruebe que el firewall de red, DNS o proxy no bloquea el acceso a Microsoft Azure Relay y vuelva a intentarlo."],"src/_new_/commands/ShareCommandUtilities":["Área de trabajo de Live Share"],"src/_new_/decorators/gaNotificationCommandDecorator":["LIve Share está ahora disponible con carácter general y queremos agradecerle su ayuda para llegar hasta aquí. Como participante, en primer lugar, seguirá recibiendo nuevas características.","Más información","Cambiar a características estables"],"src/_new_/util/WorkspaceFirewallUtil":["No se puede compartir. Visual Studio Live Share se encuentra actualmente en el modo de conexión \"Directa\" y su firewall ha bloqueado las conexiones seguras entrantes necesarias para iniciar una sesión de colaboración.\r\n\r\nPara compartir, deberá modificar las reglas de su firewall para permitir que vsls-agent.exe acepte conexiones entrantes o cambie al modo de conexión \"Automático\" o \"Retransmisión\".","El firewall está impidiendo que vsls-agent.exe acepte conexiones directas en los puertos que necesita Visual Studio Live Share para mejorar el rendimiento de la colaboración en la misma red.\r\n\r\nLive Share cambiará ahora al modo de conexión \"\"Retransmisión\"\" en todas las futuras sesiones y enrutará el tráfico mediante una retransmisión a través de la nube. Presione \"\"Cancelar\"\" para dejar de compartir","Visual Studio Live Share está actualmente en modo de conexión directa y debe aceptar conexiones protegidas entrantes al compartir para que funcione.\r\n\r\nEl firewall le pedirá ahora que ofrezca acceso a give vsls-agent.exe a los puertos requeridos. Si deniega el acceso, no podrá compartir.","Visual Studio Live Share se encuentra actualmente en el modo de conexión \"Automático\" que mejora el rendimiento de los colaboradores en la misma red al aceptar conexiones seguras entrantes al compartir.\r\n\r\nAhora su firewall le solicitará que otorgue a vsls-agent.exe acceso a los puertos requeridos. La denegación de este acceso enrutará todas las conexiones mediante una retransmisión a través de la nube."],"src/abstractions/node/agent":[]}