{"src/extension":["You have been removed from the collaboration session.","You have been blocked from the collaboration session.","More info","The companion audio extension: 'Live Share Audio' is now deprecated. Learn more about the future of audio calling in Live Share.","The host has ended the current collaboration session. Open folders and editors will now close.","The collaboration session expired. Please sign in and try again.","You have been removed from the collaboration session.","You have been blocked from the collaboration session.","You were disconnected from the collaboration session due to a connectivity problem or the host going offline.","The collaboration session has ended due to an internal error."],"src/localizeCallback":["他のコラボレーターとの間で何を行いたいですか?","他のユーザーを招待する (リンクのコピー)","招待リンクをコピーして、他の参加者に送信できるようにします。","参加者へフォロー依頼","他の参加者にフォローを要求します。","読み取り専用ターミナルの共有","ターミナルの共有","すべての参加者が使用する新しいターミナル/コマンド プロンプトを開始します。","共有サーバー","すべての参加者にローカル TCP ポートを公開します。","共有サーバーの表示","コラボレーション参加者と共有されたローカル TCP サーバーを表示します。","Start Collaboration Session","サーバー共有の停止","すべての参加者のローカル TCP ポートの共有を停止します。","コラボレーション セッションの停止","コラボレーション セッションを停止し、すべてのコンテンツの共有を停止して、すべての参加者のアクセスを削除します。","GitHub または Microsoft アカウントでサインインして、読み取り/書き込みアクセスを取得します。","共有デバッグ セッションにアタッチする","ホストが参加者と共有しているデバッグ セッションにデバッガーをアタッチします。","共有ターミナルにアクセスする","ホストが参加者と共有しているターミナルを開きます。","共有サーバーへのアクセス","名前付きの共有 TCP ポートをコピーして使用する","コラボレーション セッションから退席する","このコラボレーション セッションへの参加を中止します。","実行する操作を選択してください","コラボレーション セッションの開始","コラボレーション セッションを開始して、コンテンツを共有し、参加者を招待します。","読み取り専用コラボレーション セッションを開始する...","コラボレーション セッションを開始して、コンテンツを共有し、参加者を招待します。","コラボレーション セッションに参加する","コラボレーション セッションに参加して、共有コンテンツにアクセスします。","Shared a collaboration session.","Joined the collaboration session.","Shared","Joined","The Host doesn't allow anonymous users in the session. Consider signing in so they know who you are.","The host rejected your anonymous request. Sign in to proceed.","Sign In","もう一度コピーする","リンクをコピーする","読み取り/書き込みにする","読み取り専用にする","共有の開始","ヘルプ","OK","サインイン","匿名で続行する","詳細情報","今後は表示しない","The collaboration session is no longer active.","この招待リンクの有効期限が切れました。新しいリンクを生成するには、もう一度共有してください。","サーバーに接続できませんでした。インターネットに接続していることを確認してください。","$(shortName) サービスには、インストールされている拡張機能よりも新しいバージョンの拡張機能が必要です。","インストールされている拡張機能には、新しいバージョンの $(shortName) サービスが必要です。","インストールされている $(shortName) 拡張機能が古すぎるため、このコラボレーション セッションに接続できません。","コラボレーション セッション ホストは、お使いの $(shortName) 拡張機能より古いバージョン上にあります。","拡張機能よりも新しい $(shortName) エージェントです","その拡張機能より古い $(shortName) エージェントです","適切な IP アドレスがないため \"ダイレクト\" モードで共有できません。\"自動\" モードまたは \"リレー\" モードに切り替えて、もう一度お試しください。","互換性のある接続アドレスが見つかりませんでした。\"Auto\" モードに切り替えて、もう一度お試しください。","ホストに接続できません。あなたとホストの両方がオンラインであることを確認してください。","\"Relay\" モードではホストに接続できません。自分とホストがオンラインであることをご確認ください。オンラインである場合は、\"Auto\" または \"Direct\" モードに切り替えて、もう一度お試しください。","\"Direct\" モードではホストに接続できません。自分とホストがオンラインであることをご確認ください。オンラインである場合は、\"Auto\" または \"Relay\" モードに切り替えて、もう一度お試しください。","プロトコル エラーのためホストに参加できません。自分とホストがオンラインであることと、最新バージョンの $(shortName) を使用していることを確認してください。","認証エラーが原因で、ホストに参加できません。ホストがオンラインであることを確認してから、サインアウトした後にもう一度サインインして、もう一度お試しください。","認証エラーが原因で、ホストに参加できません。ホストがオンラインであることを確認してから、サインアウトした後にもう一度サインインして、もう一度お試しください。","予期しない認証エラーです。もう一度サインインしてみてください。","トークンの交換がコード ${code} で失敗しました","ホストはダイレクト接続を許可していません。\"Auto\" または \"Relay\" モードに切り替えて、もう一度お試しください。","ホストがリレー接続を許可していないため、接続できません。\"Auto\" または \"Direct\" モードに切り替えて、もう一度お試しください。","最大 5 人の参加者に既に達しているため、コラボレーション セッションに参加できませんでした。参加者の制限を引き上げるには、[ゲスト制限の増加] の設定を変更するようにホストに依頼し、再読み込みしてから、新しいコラボレーション セッションを開始してください。","ホストによって、コラボレーション セッションへの参加が拒否されました。","ホストが要求に応答するのを待機中にタイムアウトしました。","コラボレーション セッションへの参加要求が取り消されました。","コラボレーション セッションが見つかりません。","ホストにより、コラボレーション セッションへの参加がブロックされました。誤ってブロックされた場合は、ホストにセッションを再起動するようご依頼ください。","サーバーに接続できませんでした。失敗の状態コードを受信しました。","Live Share がログイン キーチェーンにアクセスできませんでした。これは、最近パスワードを変更したか、ログイン キーチェーンが破損している場合に生じることがあります。修正方法の詳細をご覧ください。","ホストのネットワーク状態が低下しているか、ホストが Live Share クラウド リレーに接続していません。ネットワーク状態を確認するよう依頼して、コラボレーション セッションを再開し、もう一度お試しください。","Live Share クラウド リレーに接続できません。プロキシ、ファイアウォール、ネットワークの設定を確認して、もう一度お試しください。","ホストはデバッガーの開始を許可していません。必要な場合は、有効にするよう依頼してください。","サーバーに接続できませんでした。HTTPS 接続に失敗しました。Live Share をブロックしている自己署名証明書またはカスタム証明書の検証ポリシーがないことをご確認ください。","大文字と小文字の区別を除いて同じ名前のファイルを含むディレクトリがあるようです。これは現在サポートされていないため、エラーが発生するおそれがあります。","VS Code をアプリケーション フォルダーの外部で実行しているため、ブラウザー リンクを使用してセッションに参加するためのサポートをインストールできません。手動でセッションに参加することはできます。","ブラウザー リンクを使用してセッションに参加するためのサポートをインストールできませんでした。手動でセッションに参加することはできます。","Unable to share. Visual Studio Live Share is currently in the \"Direct\" connection mode and your firewall has blocked incoming secured connections required to start a collaboration session.\n\nIn order to share, you will need to modify your firewall rules to allow vsls-agent.exe to accept incoming connections or switch to the \"Auto\" or \"Relay\" connection mode.","Failed to connect to the Live Share session.","The relay endpoint for the Live Share session is invalid or no longer exists.","The Live Share host is currently offline. This usually occurs due to the host machine being in sleep mode or host connectivity issues. Please ask them to verify their session is active.","Failed to connect to the Live Share through the relay: invalid relay SAS.","Failed to connect to the Live Share session due to an unknown relay server error.","Failed to connect to the Live Share session due to an unexpected relay error.","リモート セッションを開いています...","リモート セッションに参加しています...","ホストの承認を待機しています...","接続が失われました。ホストに再接続しています...","パスが見つかりません: lazyLoad(() => nlsloc($(path)","パスが既に存在します: lazyLoad(() => nlsloc($(path)","アクセスが拒否されました: lazyLoad(() => nlsloc($(path)","ファイルが大きすぎます。","ファイルが使用できません。","Unable to load .vsls.json file. File: $(fileName) Error: $(message) ","コラボレーション セッションへの参加を要求しました。","承認","読み取り専用を許可","読み取り/書き込みを許可","拒否","匿名を常に受け入れる","コラボレーション セッションに参加しました。","切断されました。","コラボレーション セッションから退席しました。","$(userId) がフォーカスを設定しました。","$(userId) がフォローするよう要求しました。","共同編集情報がクリップボードにコピーされました。","ブラウザー リンクを使用したセッションへの参加をサポートするには、システムでインストーラーを実行するためのアクセス許可が必要です。OS によっては、ターミナルで管理者 (sudo) パスワードの入力を求められる場合があります。今すぐインストールしますか?","代わりにコピーする","インストール","招待リンクがクリップボードにコピーされました! 信頼できるすべてのユーザーに送信します","セッションを共有しました! 招待リンクを取得するには [リンクのコピー] をクリックします ","または、セキュリティで保護された共有の詳細については、[詳細情報] をクリックしてください。","再利用可能なセッション リンクがクリップボードにコピーされました。安全な場所へのリンクを保存します。セッションの使用方法に関する詳細については、\"詳細情報\" をクリックします。","再利用可能なセッション リンクが作成されました。\"リンクのコピー\" をクリックしてリンクを取得します。安全な場所へのリンクを保存します。セッションの使用方法に関する詳細については、\"詳細情報\" をクリックします。","コラボレーションセッションに参加するには、VS Live Share でサインインしてください。","コラボレーション セッションに参加する前に、サインインする必要があります。","$(options.title)","読み取り専用モード (匿名) でターミナルを編集することはできません。サインインして続行します。","No debug session available to join.","The host is already in a collaborative debugging session that you can join.","Run and Debug are not currently available. To run and debug please ask the host to continue in an environment that can run code, like a codespace or local VS Code.","The companion audio extension: 'Live Share Audio' is now deprecated. Learn more about the future of audio calling in Live Share.","Joining Debug Session...","Select the debug session","The host has started a collaborative debugging session ","Join session now"," (読み取り専用)"," (匿名および読み取り専用)"," (匿名および読み取り/書き込み)"," (匿名)","Live Share セッション","コラボレーション セッションの開始...","Starting collaboration session...","Joining collaboration session...","Ending collaboration session..."," (読み取り専用)"," (匿名および読み取り専用)"," (匿名および読み取り/書き込み)","読み取り専用ユーザー","以下として続行","読み取り専用のゲストとしてサインインせずに続行する","サインインするためのアカウントを選択してください","${key} アカウントを使用してサインインする","コメント スレッドを作成できません","コメント スレッドを削除できません","返信できません","コメントを編集できません","コメントを保存できません","コメントの編集を取り消すことができません","コメントを削除できません","最初にスレッドの他のコメントを削除します","Live Share セッションのコメント","参加者:","Live Share チャット: 新規 $(unreads) 件","チャット","セッション チャット","Live Share チャット","チャット チャネルの選択","(新規 $(unread) 件)","$(username) が入力しています...","Type a new message","_が Live Share セッションを開始しました_","_が Live Share セッションを終了しました_","_が Live Share セッションに参加しました_","_が Live Share セッションから退席しました_","このコラボレーション セッションのホストは現在チャットから切断されているか、この機能をサポートしていないバージョンの _Live Share_ を使用しています。[詳細情報](https://aka.ms/vsls-chat)","接続しようとしている相手は現在応対できないか、この機能をサポートしていないバージョンの _Live Share_ を使用しています。[詳細情報](https://aka.ms/vsls-chat)","不明なユーザー","この連絡先とのチャット","セッション チャット チャネルを開く","チャット サービスは現在切断されています。しばらくしてからもう一度お試しください。","\"Live Share チャット\" コンパニオン拡張機能を更新してください。インストールされているバージョンとの互換性がなくなりました。[詳細情報](https://aka.ms/vsls-chat)","Do you want to save the activity log of the session?","Save Activity Log","Error saving activity log: $(error).","Activity log saved successfully.","SESSION SUMMARY","ACTIVITY LOG","COLLABORATOR DATA","RAW ACTIVITY DATA","Total number of collaborators: $(totalNumberOfCollaborators)","Total number of edited files: $(totalNumberOfEditedFiles)","Start time: $(startTime)","Session duration: $(sessionDuration)","Activity log","Open activity log...","All users","Search","Open file","See selection(s)","See edit(s)","Open terminal","$(user) opened file: $(fileName)","$(user) edited file: $(fileName)","$(user) selected text in file: $(selection)","$(user) shared terminal: $(terminalId)","$(user) stopped sharing terminal: $(terminalId)","$(user) changed terminal $(terminalId) access to read-only","$(user) changed terminal $(terminalId) access to read-write","$(user) executed command in terminal: $(terminalId)","and","結果セットには、すべての一致の内のサブセットのみが含まれています。より具体的な検索条件を指定して、結果を絞り込んでください。","Visual Studio Live Share is currently in the \"Direct\" connection mode and must accept incoming secured connections when sharing in order to function.\n\nYour firewall will now prompt you to give vsls-agent.exe access to the required ports. If you deny access, you will be unable to share.","Visual Studio Live Share is currently in the \"Auto\" connection mode that improves performance for collaborators on the same network by accepting incoming secured connections when sharing.\n\nYour firewall will now prompt you to give vsls-agent.exe access to the required ports. Denying this access will route all connections through a cloud relay instead.","[新規]","ホストがサーバー $(sessionName) を共有しました。ブラウザーで表示しますか?","はい","いいえ","ブラウザーでサーバー $(sessionName) を開くことができません。ホストによってサーバーの共有が解除されました","Live Share ワークスペース","Request read/write access","Cannot edit a read-only terminal.","Focus terminal","The host allowed read/write access to $(terminalName) terminal.","The host did not allow read/write access to $(terminalName) terminal.","No terminals are currently shared in the collaboration session.","Select shared terminal to open","Make the terminal read/write for everyone","Keep it read-only","$(participantName) requested permission to write to the $(terminalName) terminal.","Select the access level guests should have for this terminal","Host shared a Live Share terminal. Enter to type.","Read/write","ホストは、次を使用してノートブックを開いています","同じビューを使用して開きます","非共有ビューで開いているノートブックでは、共同編集はサポートされていません。","ホストのマシン上でセルを実行するためのカーネル","Live Share でノートブックが完全にサポートされるように、VS Code をバージョン 1.66.0 以降にアップグレードしてください。","ホストによって、ノートブック セルを実行するためのアクセス権が付与されました","ホストによって、ノートブック セルの実行要求が拒否されました","読み取り専用セッションでノートブック セルを実行することはできません","ホストがノートブック セルを実行するためのアクセス許可を付与していません","アクセス権を要求する","このセッションに対して許可する","常に許可する","拒否","ゲストがノートブック セルを実行するためのアクセス許可を要求しています","Could not open notebook. Please try again.","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","File","Line","Lines","to","on screen","Selection","joined the session","left the session","You are now following","You unfollowed","left your line","They left your line","switched to file","is editing the same line as you","They are editing the same line as you","is editing nearby","They are editing nearby","Selection on line","Selected lines","Looking for devices","Comments ($(count))","This collaboration session is no longer active. Please check the link provided by the host and try again.","Host is not present in the session. Please try again later.","Retry join","The specified value isn’t a valid Live Share URL. Please check the link provided by the host and try again.","The specified hostname isn’t a valid Live Share URL. Please check the link provided by the host and try again.","Your workspace was shared, but one or more folders were not local folders and couldn't be included in the shared workspace.","Your firewall is blocking vsls-agent.exe from accepting direct connections on ports Visual Studio Live Share requires to improve performance for collaborators on the same network.\n\nLive Share will now switch to the \"Relay\" connection mode for all future sessions and route traffic through a cloud relay. Press \"Cancel\" to stop sharing instead","Cannot connect to Azure Relay, you can only collaborate with guests on the same network. Please verify your network firewall or DNS or proxy is not blocking access to Microsoft Azure Relay and try again.","An update or installation of VS Live Share failed due to a corrupted download.","Live Share was unable to download needed dependencies to finish installation.","Having trouble with your Live Share installation?","$(messagePrefix) Ensure you have network connectivity then click `Repair` to restart VS Code and attempt recovery.","Unable to finish repair as files are in use. Please end all Visual Studio Live Share Agent (${processName}) processes and click `Retry`","The host has ended the current collaboration session. Open folders and editors will now close.","The collaboration session expired. Please sign in and try again.","You have been removed from the collaboration session.","You have been blocked from the collaboration session.","You were disconnected from the collaboration session due to a connectivity problem or the host going offline.","The collaboration session has ended due to an internal error.","The collaboration session has ended due to network going offline. Check your network status.","The Azure Cloud Relay went offline for this session, new guests may not be able to successfully join via relay. Consider re-sharing.","Live Share is now GA and we'd like to thank you for helping us get there! As an insider, you'll continue to receive new features first.","More info","Switch to stable features","Repair","Retry","How would you like to join this collaboration session?","Open in $(editor)","Continue in $(editor)","Re-open in $(editor)","Joining the collaboration session with $(editor)..."]}